Revit 2026 API

# DWFXExportOptions Class

---

DWFX Export options.

SystemObject Autodesk.Revit.DBCADExportOptions Autodesk.Revit.DBDWFExportOptions Autodesk.Revit.DBDWFXExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWFXExportOptions : DWFExportOptions
```
```vb
Public Class DWFXExportOptions
	Inherits DWFExportOptions
```
```cpp
public ref class DWFXExportOptions : public DWFExportOptions
```
```fsharp
type DWFXExportOptions =
    class
        inherit DWFExportOptions
    end
```

The DWFXExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWFXExportOptions | Default constructor. Sets all options to their default values. |

|  | Name | Description |
| --- | --- | --- |
|  | CropBoxVisible | Whether to export crop box.(Inherited from DWFExportOptions) |
|  | ExportingAreas | Whether to also export areas and rooms' geometry.(Inherited from DWFExportOptions) |
|  | ExportObjectData | Whether to include properties associated with elements.(Inherited from DWFExportOptions) |
|  | ExportOnlyViewId | Only export the specified view.(Inherited from DWFExportOptions) |
|  | ExportTexture | Whether to export texture.(Inherited from DWFExportOptions) |
|  | ImageFormat | Controls the compression level of images embedded.(Inherited from DWFExportOptions) |
|  | ImageQuality | Image quality level when compressed raster format(JPEG) is used.(Inherited from DWFExportOptions) |
|  | MergedViews | Whether to merge all views in one file.(Inherited from DWFExportOptions) |
|  | PaperFormat | Standard paper format.(Inherited from DWFExportOptions) |
|  | PortraitLayout | Paper orientation - Portrait/Landscape.(Inherited from DWFExportOptions) |
|  | StopOnError | Whether export process should stop when a view fails to export.(Inherited from DWFExportOptions) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace